#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db]
azurerm_mssql_server.sql: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021]
azurerm_service_plan.plan: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-21]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Storage/storageAccounts/jv1971tfstorage013]
azurerm_linux_web_app.app: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/jv1971-mywebapp-01357]
azurerm_mssql_database.db: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021/databases/ProductsDB]
azurerm_mssql_database_extended_auditing_policy.policy: Refreshing state... [id=/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021/databases/ProductsDB/extendedAuditingSettings/Default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_web_app.app must be replaced
-/+ resource "azurerm_linux_web_app" "app" {
      ~ custom_domain_verification_id     = (sensitive value)
      ~ default_hostname                  = "jv1971-mywebapp-01357.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/jv1971-mywebapp-01357" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ kind                              = "app,linux" -> (known after apply)
      ~ location                          = "westeurope" -> "eastus" # forces replacement
        name                              = "jv1971-mywebapp-01357"
      ~ outbound_ip_address_list          = [
          - "20.8.1.112",
          - "20.8.1.165",
          - "20.8.1.220",
          - "20.8.1.224",
          - "20.8.2.19",
          - "20.8.2.52",
          - "20.103.101.176",
          - "20.103.101.222",
          - "20.103.102.44",
          - "20.31.72.106",
          - "20.31.75.249",
          - "20.31.76.93",
          - "20.105.216.42",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "20.8.1.112,20.8.1.165,20.8.1.220,20.8.1.224,20.8.2.19,20.8.2.52,20.103.101.176,20.103.101.222,20.103.102.44,20.31.72.106,20.31.75.249,20.31.76.93,20.105.216.42" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "20.8.1.112",
          - "20.8.1.165",
          - "20.8.1.220",
          - "20.8.1.224",
          - "20.8.2.19",
          - "20.8.2.52",
          - "20.103.101.176",
          - "20.103.101.222",
          - "20.103.102.44",
          - "20.31.72.106",
          - "20.31.75.249",
          - "20.31.76.93",
          - "20.31.76.189",
          - "20.31.78.38",
          - "20.31.78.92",
          - "20.103.102.85",
          - "20.31.78.200",
          - "20.31.78.229",
          - "20.31.78.255",
          - "20.76.176.114",
          - "20.86.237.71",
          - "20.31.79.33",
          - "20.31.79.113",
          - "20.8.1.62",
          - "20.8.1.112",
          - "20.8.1.165",
          - "20.8.1.220",
          - "20.8.1.224",
          - "20.8.2.19",
          - "20.8.2.52",
          - "20.8.2.87",
          - "20.8.2.109",
          - "20.103.102.196",
          - "20.8.2.117",
          - "20.8.2.125",
          - "20.8.2.128",
          - "20.105.216.42",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "20.8.1.112,20.8.1.165,20.8.1.220,20.8.1.224,20.8.2.19,20.8.2.52,20.103.101.176,20.103.101.222,20.103.102.44,20.31.72.106,20.31.75.249,20.31.76.93,20.31.76.189,20.31.78.38,20.31.78.92,20.103.102.85,20.31.78.200,20.31.78.229,20.31.78.255,20.76.176.114,20.86.237.71,20.31.79.33,20.31.79.113,20.8.1.62,20.8.1.112,20.8.1.165,20.8.1.220,20.8.1.224,20.8.2.19,20.8.2.52,20.8.2.87,20.8.2.109,20.103.102.196,20.8.2.117,20.8.2.125,20.8.2.128,20.105.216.42" -> (known after apply)
      ~ service_plan_id                   = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-21" -> (known after apply)
      ~ site_credential                   = [
          - {
              - name     = "$jv1971-mywebapp-01357"
              - password = "zBgbNs5GGo0tXisYfNrJSGCDmKh9K53qCdihLE5AWXqqiFrwiseXJcaasgDG"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (7 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_parameters    = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }


      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> (known after apply)
          ~ ip_restriction                          = [] -> (known after apply)
          ~ linux_fx_version                        = "DOTNETCORE|6.0" -> (known after apply)
          ~ remote_debugging_version                = "VS2019" -> (known after apply)
          ~ scm_ip_restriction                      = [] -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (14 unchanged attributes hidden)

          ~ application_stack {
                # (1 unchanged attribute hidden)
            }
        }
        # (1 unchanged block hidden)
    }

  # azurerm_mssql_database.db must be replaced
-/+ resource "azurerm_mssql_database" "db" {
      ~ auto_pause_delay_in_minutes         = 0 -> (known after apply)
      + creation_source_database_id         = (known after apply)
      ~ id                                  = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021/databases/ProductsDB" -> (known after apply)
      ~ ledger_enabled                      = false -> (known after apply)
      + license_type                        = "LicenseIncluded"
      ~ max_size_gb                         = 250 -> (known after apply)
      ~ min_capacity                        = 0 -> (known after apply)
        name                                = "ProductsDB"
      ~ read_replica_count                  = 0 -> (known after apply)
      ~ read_scale                          = false -> (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      ~ server_id                           = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021" -> (known after apply) # forces replacement
      - tags                                = {} -> null
        # (7 unchanged attributes hidden)

      ~ long_term_retention_policy {
          ~ monthly_retention = "PT0S" -> (known after apply)
          ~ week_of_year      = 0 -> (known after apply)
          ~ weekly_retention  = "PT0S" -> (known after apply)
          ~ yearly_retention  = "PT0S" -> (known after apply)
        }

      ~ short_term_retention_policy {
          ~ backup_interval_in_hours = 24 -> (known after apply)
          ~ retention_days           = 7 -> (known after apply)
        }

      ~ threat_detection_policy {
          ~ disabled_alerts            = [] -> (known after apply)
          ~ email_account_admins       = "Disabled" -> (known after apply)
          ~ email_addresses            = [] -> (known after apply)
          ~ retention_days             = 0 -> (known after apply)
          ~ state                      = "Disabled" -> (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # azurerm_mssql_database_extended_auditing_policy.policy must be replaced
-/+ resource "azurerm_mssql_database_extended_auditing_policy" "policy" {
      ~ database_id                             = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021/databases/ProductsDB" -> (known after apply) # forces replacement
      ~ id                                      = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021/databases/ProductsDB/extendedAuditingSettings/Default" -> (known after apply)
      ~ storage_account_access_key              = (sensitive value)
      ~ storage_endpoint                        = "https://jv1971tfstorage013.blob.core.windows.net/" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_mssql_server.sql must be replaced
-/+ resource "azurerm_mssql_server" "sql" {
      ~ fully_qualified_domain_name          = "terraform-sqlserver-021.database.windows.net" -> (known after apply)
      ~ id                                   = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Sql/servers/terraform-sqlserver-021" -> (known after apply)
      ~ location                             = "westeurope" -> "eastus" # forces replacement
        name                                 = "terraform-sqlserver-021"
      + primary_user_assigned_identity_id    = (known after apply)
      ~ restorable_dropped_database_ids      = [] -> (known after apply)
      - tags                                 = {} -> null
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db" -> (known after apply)
      ~ location = "westeurope" -> "eastus" # forces replacement
        name     = "rg-terraform-web-sql-db"
      ~ tags     = {
          ~ "environment" = "preproduction" -> "pre-production"
        }
    }

  # azurerm_service_plan.plan must be replaced
-/+ resource "azurerm_service_plan" "plan" {
      ~ id                           = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-21" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ location                     = "westeurope" -> "eastus" # forces replacement
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
        name                         = "appserviceplan-web-21"
      ~ reserved                     = true -> (known after apply)
      - tags                         = {} -> null
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.storage must be replaced
-/+ resource "azurerm_storage_account" "storage" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/bc41e458-a78f-4fc1-b659-5231b5b8fe9b/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Storage/storageAccounts/jv1971tfstorage013" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ location                          = "westeurope" -> "eastus" # forces replacement
        name                              = "jv1971tfstorage013"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://jv1971tfstorage013.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "jv1971tfstorage013.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://jv1971tfstorage013.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "jv1971tfstorage013.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://jv1971tfstorage013.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "jv1971tfstorage013.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "westeurope" -> (known after apply)
      ~ primary_queue_endpoint            = "https://jv1971tfstorage013.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "jv1971tfstorage013.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://jv1971tfstorage013.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "jv1971tfstorage013.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://jv1971tfstorage013.z6.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "jv1971tfstorage013.z6.web.core.windows.net" -> (known after apply)
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      - tags                              = {} -> null
        # (14 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled      = false -> (known after apply)
          + default_service_version  = (known after apply)
          ~ last_access_time_enabled = false -> (known after apply)
          ~ versioning_enabled       = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  ~ webapp_ips = "20.8.1.112,20.8.1.165,20.8.1.220,20.8.1.224,20.8.2.19,20.8.2.52,20.103.101.176,20.103.101.222,20.103.102.44,20.31.72.106,20.31.75.249,20.31.76.93,20.105.216.42" -> (known after apply)
  ~ webapp_url = "jv1971-mywebapp-01357.azurewebsites.net" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```          

</details>          

*Pusher: @jvargh, Action: `pull_request`, Working Directory: ``, Workflow: `100-terraform-devops`*